<br>

# 데이터 랭글링(Data Wrangling) 혹은 데이터 멍잉(Data Munging)

멍잉(munging)은 전처리, 파싱, 필터링과 같이 데이터를 이리저리 핸들링한다는 뜻이다..사실 이 단어는 컴퓨터로 데이터를 처리하는 사람들 사이에서 많이 쓰이는 따끈따끈한 신조어이다.  - 전희원 저 'R로 하는 데이터 시각화' 52쪽


# **Pandas**

고수준의 자료구조(Series, DataFrame)를 지원한다.


<br>

# 📝 **Series**

일련의 객체를 기억할 수 있는 1차원 배열 구조를 갖는다.  
자동으로 index가 부여된다.

In [ ]:
import pandas as pd
import numpy as np

#Series
obj = pd.Series([3, 7, -5, 4])  #list
obj = pd.Series((3, 7, -5, 4))   #tuple
#obj = pd.Series({3, 7, -5, 4})  #set type은 오류발생 - set은 순서가 없기 때문

print(obj, ' ', type(obj))

0    3
1    7
2   -5
3    4
dtype: int64   <class 'pandas.core.series.Series'>

In [ ]:
obj2 = pd.Series([3, 7, -5, 4], index = ['a', 'b', 'c', 'd'])

print(obj2, ' ', type(obj2))

print(sum(obj2))
print(np.sum(obj2))
print(obj2.sum())
print(obj2.mean())
print(obj2.std())
print()

print(obj2.values)
print(obj2.index)

a    3
b    7
c   -5
d    4
dtype: int64   <class 'pandas.core.series.Series'>
9
9
9
2.25
5.123475382979799

[ 3  7 -5  4]
Index(['a', 'b', 'c', 'd'], dtype='object')


<br>

### 🌼 **dict type으로 Series 생성**

In [ ]:
names = {'mouse':5000, 'keyboard':25000, 'monitor':450000}
print(names, type(names))

obj3 = pd.Series(names)  #key값이 index가 됨
print(obj3, ' ', type(obj3))
print(obj3[1])
print(obj3['keyboard'])
print()

obj3.index = ['마우스','키보드','모니터']
print(obj3, ' ', type(obj3))
print()

obj3.name = '상품가격'
print(obj3)

{'mouse': 5000, 'keyboard': 25000, 'monitor': 450000} <class 'dict'>
mouse         5000
keyboard     25000
monitor     450000
dtype: int64   <class 'pandas.core.series.Series'>
25000
25000

마우스      5000
키보드     25000
모니터    450000
dtype: int64   <class 'pandas.core.series.Series'>

마우스      5000
키보드     25000
모니터    450000
Name: 상품가격, dtype: int64

<br>

## 👉 **Slicing 슬라이싱**

In [ ]:
obj2 = pd.Series([3, 7, -5, 4], index = ['a', 'b', 'c', 'd'])

print(obj2['a'])         #값출력
print(obj2[['a']])       #index와 값 함께 출력
print(obj2[['a', 'b']])
#print(obj2['a', 'c'])   #오류
print(obj2['a':'c'])     #콜론을 사용하자
print()

print(obj2[2])
print(obj2[1:4])
print(obj2[[2, 1]])
print()

print(obj2 > 0)
print('a' in obj2)

3
a    3
dtype: int64
a    3
b    7
dtype: int64
a    3
b    7
c   -5
dtype: int64

-5
b    7
c   -5
d    4
dtype: int64
c   -5
b    7
dtype: int64

a     True
b     True
c    False
d     True
dtype: bool
True

<br>

# 📝 **Data Frame**

In [ ]:
df = pd.DataFrame(obj3)
print(df, ' ', type(df))

       상품가격
마우스    5000
키보드   25000
모니터  450000   <class 'pandas.core.frame.DataFrame'>

In [ ]:
data = {
    'irum':['병구','영진','우솔','기준','은별'],
    'juso':('역삼동','신당동','역삼동', '역삼동','신사동'),
    'nai':[23, 25, 33, 30, 35],
}

print(data)
print(type(data))

{'irum': ['병구', '영진', '우솔', '기준', '은별'], 'juso': ('역삼동', '신당동', '역삼동', '역삼동', '신사동'), 'nai': [23, 25, 33, 30, 35]}
<class 'dict'>


<br>

## 👉 **DataFrame 데이터 다루기**

In [ ]:
from pandas import DataFrame, Series
frame = DataFrame(data)

print(frame)
print(frame['irum'])
print(frame.irum, ' ', type(frame.irum))

  irum juso  nai
0   병구  역삼동   23
1   영진  신당동   25
2   우솔  역삼동   33
3   기준  역삼동   30
4   은별  신사동   35
0    병구
1    영진
2    우솔
3    기준
4    은별
Name: irum, dtype: object
0    병구
1    영진
2    우솔
3    기준
4    은별
Name: irum, dtype: object   <class 'pandas.core.series.Series'>


### 전치

In [ ]:
frame2 = DataFrame(data, columns=['irum','nai','juso','tel'], index=['a','b','c','d','e'])  #컬럼순서를 바꾸고, 새로운 컬럼생성
print(frame2)

frame2['tel'] = '111-1111'
print(frame2)

val = Series(['222-222','333-1111','444-1111'], index=['b','c','e'])
frame2['tel'] = val
print(frame2)

#전치
print(frame2.T)

  irum  nai juso  tel
a   병구   23  역삼동  NaN
b   영진   25  신당동  NaN
c   우솔   33  역삼동  NaN
d   기준   30  역삼동  NaN
e   은별   35  신사동  NaN
  irum  nai juso       tel
a   병구   23  역삼동  111-1111
b   영진   25  신당동  111-1111
c   우솔   33  역삼동  111-1111
d   기준   30  역삼동  111-1111
e   은별   35  신사동  111-1111
  irum  nai juso       tel
a   병구   23  역삼동       NaN
b   영진   25  신당동   222-222
c   우솔   33  역삼동  333-1111
d   기준   30  역삼동       NaN
e   은별   35  신사동  444-1111
        a        b         c    d         e
irum   병구       영진        우솔   기준        은별
nai    23       25        33   30        35
juso  역삼동      신당동       역삼동  역삼동       신사동
tel   NaN  222-222  333-1111  NaN  444-1111

In [ ]:
#list type으로 출력
print(frame2.values)   #2차원형태로
print(type(frame2.values))  
print(frame2.values[0, 2])
print(frame2.values[0:2])

[['병구' 23 '역삼동' nan]
 ['영진' 25 '신당동' '222-222']
 ['우솔' 33 '역삼동' '333-1111']
 ['기준' 30 '역삼동' nan]
 ['은별' 35 '신사동' '444-1111']]
<class 'numpy.ndarray'>
역삼동
[['병구' 23 '역삼동' nan]
 ['영진' 25 '신당동' '222-222']]

In [ ]:
frame3 = frame2.drop('d', axis=0)   #행삭제. axis=0:기본값
print(frame3)

frame4 = frame2.drop('tel', axis=1) #열삭제
print(frame4)

  irum  nai juso       tel
a   병구   23  역삼동       NaN
b   영진   25  신당동   222-222
c   우솔   33  역삼동  333-1111
e   은별   35  신사동  444-1111
  irum  nai juso
a   병구   23  역삼동
b   영진   25  신당동
c   우솔   33  역삼동
d   기준   30  역삼동
e   은별   35  신사동


<br>

## 👉 **정렬, 순위, count : `.sort_index(), .rank(), .value_counts()`**

In [ ]:
print(frame2.sort_index(axis=0, ascending=False))
print(frame2.sort_index(axis=1, ascending=False))

print(frame2.rank(axis=0))

print(frame2['juso'].value_counts())

  irum  nai juso       tel
e   은별   35  신사동  444-1111
d   기준   30  역삼동       NaN
c   우솔   33  역삼동  333-1111
b   영진   25  신당동   222-222
a   병구   23  역삼동       NaN
        tel  nai juso irum
a       NaN   23  역삼동   병구
b   222-222   25  신당동   영진
c  333-1111   33  역삼동   우솔
d       NaN   30  역삼동   기준
e  444-1111   35  신사동   은별
   irum  nai  juso  tel
a   2.0  1.0   4.0  NaN
b   3.0  2.0   1.0  1.0
c   4.0  4.0   4.0  2.0
d   1.0  3.0   4.0  NaN
e   5.0  5.0   2.0  3.0
역삼동    3
신당동    1
신사동    1
Name: juso, dtype: int64

In [ ]:
data = {
    'juso':['강남구 역삼동', '중구 신당동', '강남구 대치동'],
    'inwon':[23, 25, 15]
}

fr = DataFrame(data)
print(fr)
print()

result1 = Series([x.split()[0] for x in fr.juso])
print(result1)

result2 = Series([x.split()[1] for x in fr.juso])
print(result2)

      juso  inwon
0  강남구 역삼동     23
1   중구 신당동     25
2  강남구 대치동     15

0    강남구
1     중구
2    강남구
dtype: object
0    역삼동
1    신당동
2    대치동
dtype: object

<br>

# 📝 Series의 재색인 : `.reindex()`

In [ ]:
data = Series([1, 3, 2], index = (1, 4, 2))
print(data)

data2 = data.reindex((1,2,4))
print(data2)

1    1
4    3
2    2
dtype: int64
1    1
2    2
4    3
dtype: int64


## 👉 재색인하며 값 채우기

In [ ]:
data3 = data2.reindex([0, 1, 2, 3, 4, 5])
print(data3) #값이 존재하지 않는 항목들은 NaN
print()

data3 = data2.reindex([0, 1, 2, 3, 4, 5], fill_value = 777)  #특정값으로 채우기
print(data3)
print()

data3 = data2.reindex([0, 1, 2, 3, 4, 5], method = 'ffill')  #forward fill : NaN의 바로 앞의 값으로 대체
#data3 = data2.reindex([0, 1, 2, 3, 4, 5], method = 'pad')   #위와 동일
print(data3)
print()

data3 = data2.reindex([0, 1, 2, 3, 4, 5], method = 'bfill')  #back fill : NaN의 바로 다음 값으로 대체
print(data3)
print()

0    NaN
1    1.0
2    2.0
3    NaN
4    3.0
5    NaN
dtype: float64

0    777
1      1
2      2
3    777
4      3
5    777
dtype: int64

0    NaN
1    1.0
2    2.0
3    2.0
4    3.0
5    3.0
dtype: float64

0    1.0
1    1.0
2    2.0
3    3.0
4    3.0
5    NaN
dtype: float64

<br>

# 📝 **DataFrame의 Slicing**

In [ ]:
import numpy as np

df = DataFrame(np.arange(12).reshape(4, 3), index=['1월','2월','3월','4월'], columns=['강남','강북','서초'])
print(df)
print()

print(df['강남'])
print()
print(df['강남'] > 3)
print()
print(df[df['강남'] > 3])
print()

print(df < 3)
df[df < 3] = 0
print(df)

    강남  강북  서초
1월   0   1   2
2월   3   4   5
3월   6   7   8
4월   9  10  11

1월    0
2월    3
3월    6
4월    9
Name: 강남, dtype: int64

1월    False
2월    False
3월     True
4월     True
Name: 강남, dtype: bool

    강남  강북  서초
3월   6   7   8
4월   9  10  11

       강남     강북     서초
1월   True   True   True
2월  False  False  False
3월  False  False  False
4월  False  False  False
    강남  강북  서초
1월   0   0   0
2월   3   4   5
3월   6   7   8
4월   9  10  11

<br>

## 👉 **Label 기능 : `.loc(), .iloc()`**

loc: 라벨 지원, iloc: 인덱스라벨지원

In [ ]:
#loc
print(df.loc['4월'])
print(df.loc['3월',])
print(df.loc[:'2월'])
print(df.loc[:'2월', ['서초']])

강남     9
강북    10
서초    11
Name: 4월, dtype: int64
강남    6
강북    7
서초    8
Name: 3월, dtype: int64
    강남  강북  서초
1월   0   0   0
2월   3   4   5
    서초
1월   0
2월   5

In [ ]:
#iloc
print(df.iloc[2])
print(df.iloc[2, :])
print()

print(df.iloc[:3])
print(df.iloc[:3, 2])
print(df.iloc[:3, 1:3])

강남    6
강북    7
서초    8
Name: 3월, dtype: int64
강남    6
강북    7
서초    8
Name: 3월, dtype: int64

    강남  강북  서초
1월   0   0   0
2월   3   4   5
3월   6   7   8
1월    0
2월    5
3월    8
Name: 서초, dtype: int64
    강북  서초
1월   0   0
2월   4   5
3월   7   8


# 📝 **산술연산**

## Series

In [ ]:
s1 = Series([1,2,3], index=['a','b','c'])
s2 = Series([4,5,6,7], index=['a','b','c','d'])

print(s1)
print(s2)

a    1
b    2
c    3
dtype: int64
a    4
b    5
c    6
d    7
dtype: int64

In [ ]:
print(s1 + s2)  #같은 index끼리 연산. 불일치할 경우 NaN
print(s1.add(s2))
print(s1 * s2)

a    5.0
b    7.0
c    9.0
d    NaN
dtype: float64
a    5.0
b    7.0
c    9.0
d    NaN
dtype: float64
a     4.0
b    10.0
c    18.0
d     NaN
dtype: float64

## DataFrame

In [ ]:
df1 = DataFrame(np.arange(9.).reshape(3, 3), columns = list('one'), index = ['서울','인천','수원'])
print(df1)
print()

df2 = DataFrame(np.arange(12.).reshape(4, 3), columns = list('one'), index = ['서울','인천','부산','광주'])
print(df2)

      o    n    e
서울  0.0  1.0  2.0
인천  3.0  4.0  5.0
수원  6.0  7.0  8.0

      o     n     e
서울  0.0   1.0   2.0
인천  3.0   4.0   5.0
부산  6.0   7.0   8.0
광주  9.0  10.0  11.0

In [ ]:
print(df1 + df2)
print(df1.add(df2, fill_value = 0))  #NaN은 0으로 채운 후 연산

      o    n     e
광주  NaN  NaN   NaN
부산  NaN  NaN   NaN
서울  0.0  2.0   4.0
수원  NaN  NaN   NaN
인천  6.0  8.0  10.0
      o     n     e
광주  9.0  10.0  11.0
부산  6.0   7.0   8.0
서울  0.0   2.0   4.0
수원  6.0   7.0   8.0
인천  6.0   8.0  10.0

In [ ]:
print(df1 * df2)
print(df1.multiply(df2, fill_value = 1))  #NaN은 1로 채운 후 연산

      o     n     e
광주  NaN   NaN   NaN
부산  NaN   NaN   NaN
서울  0.0   1.0   4.0
수원  NaN   NaN   NaN
인천  9.0  16.0  25.0
      o     n     e
광주  9.0  10.0  11.0
부산  6.0   7.0   8.0
서울  0.0   1.0   4.0
수원  6.0   7.0   8.0
인천  9.0  16.0  25.0

<br>

## Series와 DataFrame 간의 연산

DataFrame과 Series 간의 산술연산은 Series의 색인을 DataFrame의 컬럼에 맞추고 아래행으로 전파한다.  -> Broadcasting

In [ ]:
df1 = DataFrame(np.arange(9.).reshape(3, 3), columns = list('one'), index = ['서울','인천','수원'])
seri = df1.iloc[0]
print(seri)

print(df1 - seri)

o    0.0
n    1.0
e    2.0
Name: 서울, dtype: float64
      o    n    e
서울  0.0  0.0  0.0
인천  3.0  3.0  3.0
수원  6.0  6.0  6.0


<br>

# 📝 **결측치 처리**

In [ ]:
df = DataFrame([[1.3, np.nan], [7, -4.3], [np.NaN, np.NAN], [0.5, -1]], columns = ['one','two'])
print(df)
print()

#print(df.drop(1))
print(df.isnull())
print(df.notnull())

   one  two
0  1.3  NaN
1  7.0 -4.3
2  NaN  NaN
3  0.5 -1.0

     one    two
0  False   True
1  False  False
2   True   True
3  False  False
     one    two
0   True  False
1   True   True
2  False  False
3   True   True


## 👉 `.dropna()`

In [ ]:
print(df.dropna())
print()
print(df.dropna(how='any'))       #how='any': NaN이 하나라도 있으면 해당 행 제거
print()

print(df.dropna(how='all'))       #how='any': 행 전체가 NaN이라면 해당 행 제거. 하나라도 다른 값이 있으면 제거되지 않는다.
print()

print(df.dropna(subset=['two']))  #subset=['two']: 'two'컬럼에 NaN이 존재하는 행 제거. 특정열에 NaN이 있는 해당 행 제거
print()

print(df.dropna(axis='rows'))     #NaN이 포함된 행 모두 제거
print()

print(df.dropna(axis='columns'))  #NaN이 포함된 열 모두 제거

   one  two
1  7.0 -4.3
3  0.5 -1.0

   one  two
1  7.0 -4.3
3  0.5 -1.0

   one  two
0  1.3  NaN
1  7.0 -4.3
3  0.5 -1.0

   one  two
1  7.0 -4.3
3  0.5 -1.0

   one  two
1  7.0 -4.3
3  0.5 -1.0

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

<br>

## 👉 `.fillna()`

In [ ]:
print(df.fillna(0))  #NaN 0으로 대체

   one  two
0  1.3  0.0
1  7.0 -4.3
2  0.0  0.0
3  0.5 -1.0

기본적으로 NaN은 연산에서 제외한다.

In [ ]:
print(df.sum())
print(df.sum(axis=0))  #행의 합
print(df.sum(axis=1))  #열의 합

one    8.8
two   -5.3
dtype: float64
one    8.8
two   -5.3
dtype: float64
0    1.3
1    2.7
2    0.0
3   -0.5
dtype: float64

In [ ]:
print()
print(df)
print(df.mean())
print(df.mean(axis=1))
print(df.mean(axis=0, skipna = True))   #기본값
print(df.mean(axis=0, skipna = False))  #NaN 포함하여 연산

   one  two
0  1.3  NaN
1  7.0 -4.3
2  NaN  NaN
3  0.5 -1.0
one    2.933333
two   -2.650000
dtype: float64
0    1.30
1    1.35
2     NaN
3   -0.25
dtype: float64
one    2.933333
two   -2.650000
dtype: float64
one   NaN
two   NaN
dtype: float64

<br>

# 📝 **그 외 함수들**


## `.idxmax()` : 최대값의 index 출력

In [ ]:
print(df.max())
print(df.idxmax())

one    7.0
two   -1.0
dtype: float64
one    1
two    3
dtype: int64

## `.describe()` : 요약통계량

In [ ]:
print(df.describe())

            one       two
count  3.000000  2.000000
mean   2.933333 -2.650000
std    3.544479  2.333452
min    0.500000 -4.300000
25%    0.900000 -3.475000
50%    1.300000 -2.650000
75%    4.150000 -1.825000
max    7.000000 -1.000000


<br>

# 📝 **DataFrame의 형태 변경**

`.reshape() ,.stack(), .unstack()`

In [ ]:
import numpy as np
import pandas as pd

df = pd.DataFrame(1000 + np.arange(6).reshape(2, 3), index=['서울','대전'], columns=['2020','2021','2022'])
print(df)
print()

#index를 기준으로 컬럼 쌓기
df_row = df.stack()
print(df_row)
print()

#원래대로
df_col = df_row.unstack()
print(df_col)

    2020  2021  2022
서울  1000  1001  1002
대전  1003  1004  1005

서울  2020    1000
    2021    1001
    2022    1002
대전  2020    1003
    2021    1004
    2022    1005
dtype: int64

    2020  2021  2022
서울  1000  1001  1002
대전  1003  1004  1005


<br>

## 👉 **범주화 : `.cut()`**

In [ ]:
price = [10.3, 5.5, 7.8, 3.6]
cut = [3, 7, 9, 11]  #구간 기준 값

result_cut = pd.cut(price, cut)
print(result_cut)
print()

print(pd.value_counts(result_cut))

[(9, 11], (3, 7], (7, 9], (3, 7]]
Categories (3, interval[int64]): [(3, 7] < (7, 9] < (9, 11]]

(3, 7]     2
(9, 11]    1
(7, 9]     1
dtype: int64

In [ ]:
datas = pd.Series(np.arange(1, 1001))
print(datas.tail())
print()

cut2 = [1, 500, 1000]
result_cut2 = pd.cut(datas, cut2)

print(result_cut2)
print()
print(pd.value_counts(result_cut2))
print()

995     996
996     997
997     998
998     999
999    1000
dtype: int64

0                  NaN
1         (1.0, 500.0]
2         (1.0, 500.0]
3         (1.0, 500.0]
4         (1.0, 500.0]
            ...
995    (500.0, 1000.0]
996    (500.0, 1000.0]
997    (500.0, 1000.0]
998    (500.0, 1000.0]
999    (500.0, 1000.0]
Length: 1000, dtype: category
Categories (2, interval[int64]): [(1, 500] < (500, 1000]]

(500, 1000]    500
(1, 500]       499
dtype: int64

In [ ]:
result_cut3 = pd.qcut(datas, 5)
print(result_cut3)
print()
print(pd.value_counts(result_cut3))

0       (0.999, 200.8]
1       (0.999, 200.8]
2       (0.999, 200.8]
3       (0.999, 200.8]
4       (0.999, 200.8]
            ...
995    (800.2, 1000.0]
996    (800.2, 1000.0]
997    (800.2, 1000.0]
998    (800.2, 1000.0]
999    (800.2, 1000.0]
Length: 1000, dtype: category
Categories (5, interval[float64]): [(0.999, 200.8] < (200.8, 400.6] < (400.6, 600.4] < (600.4, 800.2] <
                                    (800.2, 1000.0]]

(800.2, 1000.0]    200
(600.4, 800.2]     200
(400.6, 600.4]     200
(200.8, 400.6]     200
(0.999, 200.8]     200
dtype: int64

<br>

## 👉 **Group 별로 작업하기 : `.groupby()`**


`.agg` : 소계를 구하는 함수

In [ ]:
group_col = datas.groupby(result_cut2)
print(group_col)
print()

print(group_col.agg(['count','mean','std','min']))

<pandas.core.groupby.generic.SeriesGroupBy object at 0x7f1bcfe5fe10>

             count   mean         std  min
(1, 500]       499  251.0  144.193157    2
(500, 1000]    500  750.5  144.481833  501

In [ ]:
#함수로 만들어 보기
def summary_func(gr):
  return {
      'count':gr.count(),
      'mean':gr.mean(),
      'std':gr.std(),
      'min':gr.min()
  }

print(group_col.apply(summary_func))
print()
print(group_col.apply(summary_func).unstack())

(1, 500]     count    499.000000
             mean     251.000000
             std      144.193157
             min        2.000000
(500, 1000]  count    500.000000
             mean     750.500000
             std      144.481833
             min      501.000000
dtype: float64

             count   mean         std    min
(1, 500]     499.0  251.0  144.193157    2.0
(500, 1000]  500.0  750.5  144.481833  501.0


## 👉 **자료 병합하기**

`.merge()` : key를 기준으로 병합한다.


### 🌼 공통 컬럼이 있는 경우

In [ ]:
df1 = pd.DataFrame({'data1':range(7), 'key':['b','b','a','c','a','a','b']})
print(df1)
print()

df2 = pd.DataFrame({'key':['a','b','d'], 'data2':range(3)})
print(df2)
print()

#공통컬럼이 있는 데이터들에 대해서만 작업
#SQL의 INNER JOIN
print(pd.merge(df1, df2, on='key'))
print()
print(pd.merge(df1, df2, on='key', how='inner'))  #위와 동일
print()

#OUTER JOIN
print(pd.merge(df1, df2, on='key', how='outer'))
print()

#LEFT OUTER JOIN
print(pd.merge(df1, df2, on='key', how='left'))
print()

#RIGHT OUTER JOIN
print(pd.merge(df1, df2, on='key', how='right'))

   data1 key
0      0   b
1      1   b
2      2   a
3      3   c
4      4   a
5      5   a
6      6   b

  key  data2
0   a      0
1   b      1
2   d      2

   data1 key  data2
0      0   b      1
1      1   b      1
2      6   b      1
3      2   a      0
4      4   a      0
5      5   a      0

   data1 key  data2
0      0   b      1
1      1   b      1
2      6   b      1
3      2   a      0
4      4   a      0
5      5   a      0

   data1 key  data2
0    0.0   b    1.0
1    1.0   b    1.0
2    6.0   b    1.0
3    2.0   a    0.0
4    4.0   a    0.0
5    5.0   a    0.0
6    3.0   c    NaN
7    NaN   d    2.0

   data1 key  data2
0      0   b    1.0
1      1   b    1.0
2      2   a    0.0
3      3   c    NaN
4      4   a    0.0
5      5   a    0.0
6      6   b    1.0

   data1 key  data2
0    2.0   a      0
1    4.0   a      0
2    5.0   a      0
3    0.0   b      1
4    1.0   b      1
5    6.0   b      1
6    NaN   d      2

<br>

### 🌼 공통 컬럼이 없는 경우

`.concat()`

In [ ]:
df3 = pd.DataFrame({'key2':['a','b','d'], 'data2':range(3)}) #df1, df2와 공통 컬럼X
print(df3)
print()

#INNER JOIN
print(pd.merge(df1, df3, left_on='key', right_on='key2'))
print()

print(pd.concat([df1, df3])) #대응되지 않으면 NaN
print()

#이어붙이기
print(pd.concat([df1, df3], axis=0))
print()
print(pd.concat([df1, df3], axis=1))
print()

  key2  data2
0    a      0
1    b      1
2    d      2

   data1 key key2  data2
0      0   b    b      1
1      1   b    b      1
2      6   b    b      1
3      2   a    a      0
4      4   a    a      0
5      5   a    a      0

   data1  key key2  data2
0    0.0    b  NaN    NaN
1    1.0    b  NaN    NaN
2    2.0    a  NaN    NaN
3    3.0    c  NaN    NaN
4    4.0    a  NaN    NaN
5    5.0    a  NaN    NaN
6    6.0    b  NaN    NaN
0    NaN  NaN    a    0.0
1    NaN  NaN    b    1.0
2    NaN  NaN    d    2.0

   data1  key key2  data2
0    0.0    b  NaN    NaN
1    1.0    b  NaN    NaN
2    2.0    a  NaN    NaN
3    3.0    c  NaN    NaN
4    4.0    a  NaN    NaN
5    5.0    a  NaN    NaN
6    6.0    b  NaN    NaN
0    NaN  NaN    a    0.0
1    NaN  NaN    b    1.0
2    NaN  NaN    d    2.0

   data1 key key2  data2
0      0   b    a    0.0
1      1   b    b    1.0
2      2   a    d    2.0
3      3   c  NaN    NaN
4      4   a  NaN    NaN
5      5   a  NaN    NaN
6      6   b  NaN    NaN

<br>

## Series의 병합

In [ ]:
s1 = pd.Series([0,1], index = ['a','b'])
s2 = pd.Series([2,3,4], index = ['c','d','e'])
s3 = pd.Series([5,6], index = ['f','g'])

print(pd.concat([s1, s2, s3], axis=0))

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64


<br>

## 👉 **Pivot table 피벗테이블**

데이터의 행렬을 재구성하여 연산 후 결과를 출력

In [ ]:
data = {'city':['강남','강북','강남','강북'],
        'year':[2000,2001,2002,2002],
        'pop':[3.3,2.5,3.0,2.0]}

df = pd.DataFrame(data)
print(df)
print()
print(df['pop'].describe())

  city  year  pop
0   강남  2000  3.3
1   강북  2001  2.5
2   강남  2002  3.0
3   강북  2002  2.0

count    4.000000
mean     2.700000
std      0.571548
min      2.000000
25%      2.375000
50%      2.750000
75%      3.075000
max      3.300000
Name: pop, dtype: float64

<br>

### `.pivot()`

In [ ]:
print(df.pivot('city','year','pop'))  #행,열,계산할 컬럼. 구조를 재구성하여 출력
print()
print(df.set_index(['city','year']).unstack())  #.set_index() : 기존의 행 index를 제거하고 첫번째 열을 인덱스로 설정
print()

print(df.pivot('year','city','pop'))
print()
print(df.set_index(['year','city']).unstack()) 
print()

year  2000  2001  2002
city
강남     3.3   NaN   3.0
강북     NaN   2.5   2.0

      pop
year 2000 2001 2002
city
강남    3.3  NaN  3.0
강북    NaN  2.5  2.0

city   강남   강북
year
2000  3.3  NaN
2001  NaN  2.5
2002  3.0  2.0

      pop
city   강남   강북
year
2000  3.3  NaN
2001  NaN  2.5
2002  3.0  2.0

<br>

### `.pivot_table()` : 연산 가능

In [ ]:
print(df.pivot_table(index=['city']))
print()

print(df.pivot_table(index=['city'], aggfunc = np.mean))  #aggfunc=np.mean: 기본값. 위와 동일
print()

print(df.pivot_table(index=['city','year'], aggfunc = np.mean))
print()

print(df.pivot_table(index=['city','year'], aggfunc = [len, np.sum]))
print()

       pop    year
city
강남    3.15  2001.0
강북    2.25  2001.5

       pop    year
city
강남    3.15  2001.0
강북    2.25  2001.5

           pop
city year
강남   2000  3.3
     2002  3.0
강북   2001  2.5
     2002  2.0

           len  sum
           pop  pop
city year
강남   2000  1.0  3.3
     2002  1.0  3.0
강북   2001  1.0  2.5
     2002  1.0  2.0

In [ ]:
#연산 대상 지정
print(df.pivot_table(values=['pop'], index='city', aggfunc=np.mean))  
print()

print(df.pivot_table(values=['pop'], index='city', aggfunc = len))
print()

print(df.pivot_table(values=['pop'], index='year', columns='city'))
print()

print(df.pivot_table(values=['pop'], index='year', columns='city', margins=True))
print()

print(df.pivot_table(values=['pop'], index='year', columns='city', margins=True, fill_value=0))

       pop
city
강남    3.15
강북    2.25

      pop
city
강남    2.0
강북    2.0

      pop
city   강남   강북
year
2000  3.3  NaN
2001  NaN  2.5
2002  3.0  2.0

       pop
city    강남    강북  All
year
2000  3.30   NaN  3.3
2001   NaN  2.50  2.5
2002  3.00  2.00  2.5
All   3.15  2.25  2.7

       pop
city    강남    강북  All
year
2000  3.30  0.00  3.3
2001  0.00  2.50  2.5
2002  3.00  2.00  2.5
All   3.15  2.25  2.7

In [ ]:
#groupby 사용
hap = df.groupby(['city'])
print(hap)
print(hap.sum())
print()

print(df.groupby(['city']).sum())  #한 줄로 표현
print()

print(df.groupby(['city','year']).sum())

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x7f1bcfe20e50>
      year  pop
city
강남    4002  6.3
강북    4003  4.5

      year  pop
city
강남    4002  6.3
강북    4003  4.5

           pop
city year
강남   2000  3.3
     2002  3.0
강북   2001  2.5
     2002  2.0

<br>

# 📝 **Pandas File I/O**

<br>

## 👉 파일 읽기

In [ ]:
import pandas as pd

#df = pd.read_csv('../testdata/ex1.csv')
df = pd.read_csv('https://raw.githubusercontent.com/pykwon/python/master/testdata_utf8/ex1.csv')
print(df, type(df))
print()

df = pd.read_table('https://raw.githubusercontent.com/pykwon/python/master/testdata_utf8/ex1.csv', sep=',')
print(df)
print()

#df = pd.read_csv('https://raw.githubusercontent.com/pykwon/python/master/testdata_utf8/ex2.csv')
df = pd.read_csv('https://raw.githubusercontent.com/pykwon/python/master/testdata_utf8/ex2.csv', header=None)
print(df)
print()

df = pd.read_csv('https://raw.githubusercontent.com/pykwon/python/master/testdata_utf8/ex2.csv', header=None, names=['a','b'])
print(df)  #뒤에서부터 컬럼명 부여
print()

df = pd.read_csv('https://raw.githubusercontent.com/pykwon/python/master/testdata_utf8/ex2.csv', header=None, names=['a','b','c','d','e'])
print(df)  #컬럼명부여
print()

df = pd.read_csv('https://raw.githubusercontent.com/pykwon/python/master/testdata_utf8/ex2.csv', header=None, names=['a','b','c','d','msg'],
                 index_col = 'msg')  #msg 컬럼을 행 인덱스로
print(df)

   bunho irum  kor  eng
0      1  홍길동   90   90
1      2  신기해   95   80
2      3  한국인  100   85
3      4  박치기   67   54
4      5  마당쇠   55  100 <class 'pandas.core.frame.DataFrame'>

   bunho irum  kor  eng
0      1  홍길동   90   90
1      2  신기해   95   80
2      3  한국인  100   85
3      4  박치기   67   54
4      5  마당쇠   55  100

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

          a      b
1 2  3    4  hello
5 6  7    8  world
9 10 11  12    foo

   a   b   c   d      e
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

       a   b   c   d
msg
hello  1   2   3   4
world  5   6   7   8
foo    9  10  11  12

In [ ]:
#df = pd.read_csv('https://raw.githubusercontent.com/pykwon/python/master/testdata_utf8/ex3.txt')
print(df)
print()

df = pd.read_table('https://raw.githubusercontent.com/pykwon/python/master/testdata_utf8/ex3.txt', sep='\s+') #공백이 0개 이상. 정규표현식 사용
print(df)
print()

df = pd.read_table('https://raw.githubusercontent.com/pykwon/python/master/testdata_utf8/ex3.txt', sep='\s+',
                   skiprows=[1, 3])  #1행, 3행 제외 
print(df)
print()

       a   b   c   d
msg
hello  1   2   3   4
world  5   6   7   8
foo    9  10  11  12

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

            A         B         C
bbb  0.927272  0.302904 -0.032399
ddd -0.871858 -0.348382  1.100491

In [ ]:
abc = pd.read_fwf('https://raw.githubusercontent.com/pykwon/python/master/testdata_utf8/data_fwt.txt', 
                  widths=(10, 3, 5), encoding='utf-8', header=None, names=('date','name','price'))

print(abc)
print()
print(abc['date'])

         date name  price
0  2017-04-10  네이버  32000
1  2017-04-11  네이버  34000
2  2017-04-12  네이버  33000
3  2017-04-10  코리아  22000
4  2017-04-11  코리아  21000
5  2017-04-12  코리아  24000

0    2017-04-10
1    2017-04-11
2    2017-04-12
3    2017-04-10
4    2017-04-11
5    2017-04-12
Name: date, dtype: object

<br>

## Chunk 단위로 파일 읽기

In [ ]:
import pandas as pd

In [ ]:
#객체로 생성
abc = pd.read_csv('https://raw.githubusercontent.com/pykwon/python/master/testdata_utf8/data_csv2.csv', header=None, chunksize=3)
print(abc)
print()

for piece in abc:
  #print(piece)
  print(piece.sort_values(by=2, ascending=True))

<pandas.io.parsers.TextFileReader object at 0x7f1bcfe58950>

   0    1     2
2  3  바나나  1000
0  1   사과  3500
1  2    배  5000
   0      1     2
4  5     참외  2000
5  6  에스프레소  5500
3  4     수박  7000
   0      1     2
6  7  아메리카노  2000
7  8   카페라떼  4000
8  9   카푸치노  4000
    0     1     2
9  10  카페모카  5000

<br>

## 👉 파일 저장


### HTML로 내보내기

In [ ]:
import pandas as pd

items = {'apple':{'count':10, 'price':2000}, 'orange':{'count':5, 'price':1000}}
df = pd.DataFrame(items)
print(df)

print(df.to_html())

       apple  orange
count     10       5
price   2000    1000
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>apple</th>
      <th>orange</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>count</th>
      <td>10</td>
      <td>5</td>
    </tr>
    <tr>
      <th>price</th>
      <td>2000</td>
      <td>1000</td>
    </tr>
  </tbody>
</table>

<br>

### CSV로 내보내기

In [ ]:
df.to_csv('/content/drive/MyDrive/work/aa1.csv', sep=',')
df.to_csv('aa2.csv', sep=',', index=False)
df.to_csv('aa3.csv', sep=',', index=False, header=False)

data = df.T
data.to_csv('aa4.csv', sep=',', index=False, header=True)
print(pd.read_csv('aa4.csv'))

   count  price
0     10   2000
1      5   1000

<br>

### Excel로 내보내기

In [ ]:
!pip install xlsxwriter

Collecting xlsxwriter
  Downloading https://files.pythonhosted.org/packages/2c/ce/74fd8d638a5b82ea0c6f08a5978f741c2655a38c3d6e82f73a0f084377e6/XlsxWriter-1.4.3-py2.py3-none-any.whl (149kB)
     |████████████████████████████████| 153kB 7.1MB/s
Installing collected packages: xlsxwriter
Successfully installed xlsxwriter-1.4.3

In [ ]:
df2 = pd.DataFrame({'data':[10, 20, 30, 30, 15]})
print(df2)
print()

#1)
#Excel 파일을 다룰 때는 반드시 sheet name을 써줘야한다.
writer = pd.ExcelWriter('aa5.xlsx', engine='xlsxwriter')
df2.to_excel(writer, sheet_name='Sheet1')
writer.save()

#2)
df2.to_excel('aa55.xlsx')

#3) Excel File 읽기
kbb = pd.ExcelFile('aa55.xlsx')
print(kbb.sheet_names)
df3 = kbb.parse('Sheet1')
print(df3)
print()

#4)encoding
df4 = pd.read_excel('aa5.xlsx', sheet_name='Sheet1')
print(df4)

   data
0    10
1    20
2    30
3    30
4    15

['Sheet1']
   Unnamed: 0  data
0           0    10
1           1    20
2           2    30
3           3    30
4           4    15

   Unnamed: 0  data
0           0    10
1           1    20
2           2    30
3           3    30
4           4    15